{
  "file_e_fogli_excel": {
    "impostazioni_file": {
      "percorso_file_excel": "Percorso completo del file Excel che contiene i dati e i parametri dell'automazione.",
      "nome_foglio_dati": "Nome del foglio di lavoro Excel contenente i dati da elaborare (es. 'DataEasePyton').",
      "nome_foglio_avanzamento": "Nome del foglio di lavoro Excel che contiene i parametri di controllo del processo (es. 'ParametriPyton')."
    },
    "mappature_colonne_foglio_avanzamento": {
      "colonna_stato": "Lettera della colonna nel foglio 'Avanzamento' che indica lo stato del task (es. 'D' per 'DA COMPLETARE').",
      "colonna_riga_inizio": "Lettera della colonna nel foglio 'Avanzamento' che indica la riga di partenza dei dati da leggere nel foglio 'Dati'.",
      "colonna_riga_fine": "Lettera della colonna nel foglio 'Avanzamento' che indica la riga di fine dei dati da leggere nel foglio 'Dati'.",
      "colonna_data_rapporto": "Lettera della colonna nel foglio 'Avanzamento' che contiene la data da inserire nel rapportino."
    },
    "mappatura_colonne_profili": {
      "profili": {
        "impostazioni_odc": {
          "regione_screenshot_popup_generico": "Regione (X, Y, Larghezza, Altezza) dello schermo dove appare il popup 'non trovato'. Cruciale per rilevare errori di inserimento Matricola o l'inizio della creazione di un nuovo ODC.",
          "testo_da_cercare_popup_generico": "Testo esatto (sensibile a maiuscole/minuscole) che l'OCR deve trovare per confermare il popup 'non trovato'. Modificare solo se il testo del popup cambia.",
          "pausa_attesa_popup": "Secondi di attesa prima di effettuare lo screenshot del popup. Aumentare leggermente se i popup non vengono rilevati a causa della lentezza dell'applicazione remota.",
          "coordinate_popup_tasto_no": "Coordinate (X, Y) del pulsante 'No' sul popup 'non trovato'. Usato per annullare la creazione di un ODC quando la Matricola è errata.",
          "coordinate_barra_preferiti": "Coordinate (X, Y) per cliccare sulla barra dei preferiti nell'applicazione remota per avviare la creazione di un ODC.",
          "coordinate_commesse_variante": "Coordinate (X, Y) per selezionare l'opzione 'Commesse in Variante' (o simile) dal menu dei preferiti.",
          "coordinate_casella_commessa": "Coordinate (X, Y) del campo dove inserire il codice della Commessa nella finestra di creazione ODC.",
          "coordinate_casella_descrizione": "Coordinate (X, Y) del campo 'Descrizione' nella finestra di creazione ODC.",
          "coordinate_casella_commessa_padre": "Coordinate (X, Y) del campo 'Commessa Padre' nella finestra di creazione ODC.",
          "coordinate_casella_ns_rif": "Coordinate (X, Y) del campo 'Ns. Rif.' nella finestra di creazione ODC.",
          "coordinate_apri_elenco_gruppo": "Coordinate (X, Y) del pulsante per aprire l'elenco dei gruppi ODC.",
          "coordinate_casella_gruppo_generico": "Coordinate (X, Y) per selezionare il gruppo 'GENERICO' dall'elenco.",
          "coordinate_casella_resp_commessa": "Coordinate (X, Y) del campo 'Responsabile Commessa' nella finestra di creazione ODC.",
          "coordinate_casella_resp_cantiere": "Coordinate (X, Y) del campo 'Responsabile Cantiere' nella finestra di creazione ODC.",
          "coordinate_barra_causali_depositi": "Coordinate (X, Y) per cliccare sulla scheda/sezione 'Causali e Depositi' nella finestra di creazione ODC.",
          "coordinate_apri_elenco_deposito": "Coordinate (X, Y) del pulsante per aprire l'elenco dei depositi.",
          "coordinate_casella_deposito": "Coordinate (X, Y) per selezionare il deposito corretto dall'elenco.",
          "coordinate_chiudi_rapportino_commessa": "Coordinate (X, Y) del pulsante per chiudere la finestra di creazione ODC dopo il salvataggio.",
          "regione_popup_attenzione_sal": "Regione (X, Y, Larghezza, Altezza) del popup 'Attenzione SAL' che può apparire durante la creazione di un ODC.",
          "testo_popup_attenzione_sal": "Testo chiave da cercare nel popup 'Attenzione SAL' per confermarne la presenza.",
          "coordinate_click_popup_attenzione_sal": "Coordinate (X, Y) del pulsante 'OK' o 'Conferma' sul popup 'Attenzione SAL'.",
          "regione_popup_codice_iva": "Regione (X, Y, Larghezza, Altezza) del popup informativo sul codice IVA.",
          "testo_popup_codice_iva": "Testo chiave da cercare nel popup del codice IVA per confermarne la presenza.",
          "coordinate_click_popup_codice_iva": "Coordinate (X, Y) del pulsante 'OK' o 'Conferma' sul popup del codice IVA.",
          "regione_popup_matricola_disabilitata": "Regione (X, Y, Larghezza, Altezza) dove appare il popup che segnala una matricola disabilitata. Se non impostata, questo controllo viene saltato.",
          "regione_popup_odc_gia_registrato": "Regione (X, Y, Larghezza, Altezza) dove appare il popup generico che segnala che la commessa è 'già registrata'. Questo è un caso di successo.",
          "colonna_nome_dipendente": "Lettera della colonna nel foglio 'Dati' che contiene il nome del dipendente, da mostrare all'utente in caso di errore sulla matricola.",
          "regione_popup_odc_gia_registrato_specifico": "Regione (X, Y, Larghezza, Altezza) del popup specifico 'COMMESSA già esistente'. Ha la precedenza su quello generico.",
          "coordinate_chiudi_commessa_variante": "Coordinate (X, Y) del pulsante 'Chiudi' nella finestra 'Commesse in Variante', usato per annullare dopo aver rilevato un ODC già registrato.",
          "coordinate_non_salvare_commessa_variante": "Coordinate (X, Y) del pulsante 'Non Salvare' che appare dopo aver chiuso la finestra 'Commesse in Variante'.",
          "coordinate_chiudi_popup_generico": "Coordinate (X, Y) del pulsante 'OK' o 'Chiudi' sul popup generico di 'ODC già registrato'."
        }
      }
    }
  },
  "timing_e_ritardi": {
    "y_iniziale_remoto": "Coordinata Y di partenza per la prima riga da compilare nell'applicazione remota.",
    "incremento_y_remoto": "Numero di pixel da aggiungere alla coordinata Y per passare alla riga successiva.",
    "max_righe_per_blocco_tab": "Numero massimo di righe da compilare prima di eseguire una serie di 'Tab' per spostarsi al blocco successivo.",
    "pressioni_tasto_tab": "Numero di volte che il tasto 'Tab' viene premuto per navigare tra i blocchi.",
    "intervallo_pressioni_tab": "Intervallo in secondi tra una pressione e l'altra del tasto 'Tab'.",
    "pausa_dopo_blocco_tab": "Secondi di pausa dopo aver navigato a un nuovo blocco di righe.",
    "ritardo_movimento_mouse": "Durata in secondi del movimento del mouse verso una coordinata.",
    "ritardo_dopo_movimento": "Secondi di pausa dopo che il mouse ha raggiunto la destinazione.",
    "ritardo_click_singolo": "[CRITICO] Pausa DOPO un click. Fondamentale per dare tempo all'app esterna di reagire. Aumentare se i dati vengono incollati nel campo sbagliato.",
    "ritardo_prima_incolla": "[CRITICO] Pausa PRIMA di incollare (Ctrl+V). Aumentare per dare tempo al campo di attivarsi correttamente dopo il click o dopo un Ctrl+A.",
    "ritardo_dopo_tab": "[CRITICO] Pausa DOPO aver premuto 'Tab'. Essenziale per garantire che il focus sia sul nuovo campo prima di procedere.",
    "ritardo_dopo_copia_excel": "[IMPORTANTE] Pausa DOPO aver copiato un valore da Excel. Assicura che il valore sia correttamente negli appunti prima di incollarlo.",
    "ritardo_dopo_select_all": "[IMPORTANTE] Pausa DOPO aver selezionato tutto (Ctrl+A). Dà tempo all'app esterna di processare la selezione prima di sovrascrivere.",
    "tentativi_max_copia_excel": "Numero massimo di tentativi per copiare un valore dagli appunti se la verifica fallisce.",
    "ritardo_tra_tentativi_copia": "Secondi di pausa tra un tentativo di copia e il successivo.",
    "ritardo_prima_copia_finale": "Breve pausa prima di copiare un valore negli appunti subito prima di incollarlo.",
    "ritardo_prima_copia_verifica": "Breve pausa prima di copiare un valore negli appunti per la verifica.",
    "pausa_prima_salvataggio_openpyxl": "Secondi di attesa prima di tentare di salvare il file Excel con openpyxl.",
    "pausa_tra_azioni_preliminari_finali": "Secondi di pausa tra le azioni principali (es. inserimento data, salvataggio).",
    "tentativi_max_salvataggio_excel": "Numero massimo di tentativi per salvare il file Excel in caso di errore (es. file bloccato).",
    "ritardo_tra_tentativi_salvataggio": "Secondi di attesa tra un tentativo di salvataggio e il successivo."
  },
  "pulizia_appunti": {
    "pausa_1": "[IMPORTANTE] Prima pausa nel ciclo di pulizia degli appunti. Contribuisce alla stabilità della copia.",
    "pausa_2": "[IMPORTANTE] Seconda pausa nel ciclo di pulizia degli appunti. Contribuisce alla stabilità della copia.",
    "pausa_3": "[IMPORTANTE] Terza pausa nel ciclo di pulizia degli appunti. Contribuisce alla stabilità della copia.",
    "riconferma_copia_pausa": "[IMPORTANTE] Breve pausa aggiuntiva dopo una copia riuscita per garantirne la stabilità."
  },
  "tasti_rapidi": {
    "prosegui": "Tasto da premere per confermare che l'inserimento dati è terminato e si può procedere al salvataggio.",
    "riavvia": "Tasto da premere in qualsiasi momento per interrompere e riavviare l'automazione dall'inizio."
  }
}